Repository: younici/ReminderBot
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: ru, uk

# GREETING
source: Hi! I'm ReminderBot — I can schedule one-off reminders. Share your location and send /help to see the commands.
ru: Привет! Я ReminderBot — помогу не забыть важные дела. Отправьте геолокацию и команду /help, чтобы посмотреть возможности.
uk: Вітаю! Я ReminderBot — допоможу не забути важливі справи. Надішліть геолокацію та команду /help, щоб побачити мої можливості.

# SEND_LOCATION
source: Share location
ru: Отправить геолокацию
uk: Надіслати геолокацію

# HELP_ANSWER
source: 💡 Available commands: /start — register and share your geolocation /remind <text>; dd.mm HH:MM — create a reminder (e.g., /remind buy milk; 23.12 12:00) /remind_list — show a list of all active reminders /dell_remind <id> — delete a reminder by its ID /language — change the interface language /help — show this message
ru: 💡 Доступные команды: /start — пройти регистрацию и поделиться геолокацией /remind <текст>; dd.mm HH:MM — создать напоминание (пример: /remind купить молоко; 23.12 12:00) /remind_list — показать список всех активных напоминаний /dell_remind <id> — удалить напоминание по его ID /language — изменить язык интерфейса /help — показать это сообщение
uk: 💡 Доступні команди: /start — пройти реєстрацію та поділитися геолокацією /remind <текст>; dd.mm HH:MM — створити нагадування (приклад: /remind купити молоко; 23.12 12:00) /remind_list — показати список усіх активних нагадувань /dell_remind <id> — видалити нагадування за його ID /language — змінити мову інтерфейсу /help — показати це повідомлення

# USER_NOT_REGISTERED
source: Please run /start first so I can register you.
ru: Сначала выполните /start, чтобы я запомнил вас.
uk: Спочатку виконайте /start, щоб я міг вас запам'ятати.

# CHOOSE_LANGUAGE
source: Choose the language you prefer:
ru: Выберите язык, на котором вам удобнее общаться:
uk: Оберіть мову, якою вам зручно спілкуватися:

# LANGUAGE_CHANGED
source: Great! I'll speak this language from now on.
ru: Готово! Теперь буду отвечать на этом языке.
uk: Готово! Далі спілкуємося цією мовою.

# REMIND_CMD_ERR
source: Use /remind <text>; dd.mm HH:MM — for example /remind buy milk; 23.12 12:00.
ru: Используйте формат /remind <текст>; dd.mm HH:MM — например, /remind купить молоко; 23.12 12:00.
uk: Використовуйте формат /remind <текст>; dd.mm HH:MM — наприклад, /remind купити молоко; 23.12 12:00.

# REMIND_TIME_INCORRECT
source: The reminder time must be in the future.
ru: Укажите время из будущего — я не могу вернуться назад.
uk: Час нагадування має бути з майбутнього.

# REMIND_ADDED
source: Reminder saved — I'll ping you on time.
ru: Напоминание сохранено — напомню точно в срок.
uk: Нагадування збережено — повідомлю вчасно.

# ALREADY_REGISTERED
source: You're already registered.
ru: Вы уже зарегистрированы.
uk: Ви вже зареєстровані.

# GET_LOCATION_ERR
source: I couldn't detect your location. Please try again.
ru: Не удалось определить геолокацию. Попробуйте ещё раз.
uk: Не вдалося визначити геолокацію. Спробуйте ще раз.

# LANGUAGE_NOT_SUPPORTED
source: That language isn't supported yet.
ru: Этот язык пока не поддерживается.
uk: Цю мову поки не підтримуємо.

# REMIND_EXIST
source: This reminder already exists in the database
ru: Это упоминание уже есть в базе данных
uk: Це нагадування вже є в базі даних
